<a href="https://colab.research.google.com/github/YuDeokRin/Kotlin_Programming_Practice/blob/master/2020%EB%85%84_9%EC%9B%94_15%EC%9D%BC_%EC%88%98%EC%97%85%EC%8B%9C%EA%B0%84_%EC%98%88%EC%A0%9C.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
#딕셔너리
#key: C0, C1 : 칸이름
#value: [1,2,3],[4,5,6] : 칸의 값이 된다
dic_data={
    "C0":[1,2,3],
    "C1":[4,5,6]
    }

In [ ]:
pd.DataFrame(dic_data)

   C0  C1
0   1   4
1   2   5
2   3   6

2.강의 자료 12페이지 인덱스와 컬럼

 * 2. 1 인덱스 -> 줄이름
 * 줄 이름으로 특정 줄만 검색가능

In [ ]:
pd.DataFrame(dic_data, 
             index=["홍길동","홍길순","김태희"] # 줄이름 (index)
             )

     C0  C1
홍길동   1   4
홍길순   2   5
김태희   3   6

In [ ]:
df = pd.DataFrame(dic_data, 
             index=["홍길동","홍길순","김태희"] # 줄이름 (index)
             )

In [ ]:
df

     C0  C1
홍길동   1   4
홍길순   2   5
김태희   3   6

In [ ]:
#df.loc["줄이름"] : 줄이름의 줄만 조회
df.loc["홍길순"]

C0    2
C1    5
Name: 홍길순, dtype: int64

2. 2 columns 속성 설정

In [ ]:
#dic_data : columns 순서가 C0,C1 순서
#싫다 !! 난 columns 순서 C1, C0 하고싶다 
#columns=["C1","C0"]  : 컬럼 순서가 C1, C0으로 변환
pd.DataFrame(dic_data, 
             index=["홍길동","홍길순","김태희"] ,# 줄이름 (index)
             columns=["C1","C0"] 
             )

     C1  C0
홍길동   4   1
홍길순   5   2
김태희   6   3

강의 자료 12페이지 예제 - 리스트를 이용해서 DataFrame 생성

In [ ]:
pd.DataFrame([
              [15, "남"],  # <--- 1줄
              [17, "여"]   # <--- 1줄
            ]
             )

    0  1
0  15  남
1  17  여

In [ ]:
#칸이름 설정 하고 싶다 columns=["칸이름1", "칸이름2"]
pd.DataFrame([
              [15, "남"],  # <--- 1줄
              [17, "여"]   # <--- 1줄
            ], columns=["나이","성별"]
             )

   나이 성별
0  15  남
1  17  여

In [ ]:
#칸이름 설정 하고 싶다 columns=["칸이름1", "칸이름2"]
#줄 이름 설정 하고 싶다  index=["줄이름1","줄이름2"]
df = pd.DataFrame([
              [15, "남"],  # <--- 1줄
              [17, "여"]   # <--- 1줄
            ], columns=["나이","성별"],
             index=["준서","예은"]
             )

In [ ]:
df.loc["예은"]

나이    17
성별     여
Name: 예은, dtype: object

2. 4 인덱스 수정

In [ ]:
df.index=["학생1","학생2"]
df

     나이 성별
학생1  15  남
학생2  17  여

2. 5 칸이름 수정

In [ ]:
df.columns=["연령", "남녀"]
df

     연령 남녀
학생1  15  남
학생2  17  여

2. 6 줄이름 일부만 수정

In [ ]:
df.rename(index={"학생2":"예은"})  # 임시로 바꿔주는것

     연령 남녀
학생1  15  남
예은   17  여

In [ ]:
df

     연령 남녀
학생1  15  남
학생2  17  여

In [ ]:
df.rename(index={"학생2":"예은"}, inplace=True) # 완전히 바꿔주는 것 
df

     연령 남녀
학생1  15  남
예은   17  여

2. 7칸이름 일부만 수정

In [ ]:
df.rename(columns={"남녀": "성별"})

     연령 성별
학생1  15  남
예은   17  여

In [ ]:
df

     연령 남녀
학생1  15  남
예은   17  여

In [ ]:
df.rename(columns={"남녀": "성별"}, inplace=True)
df

     연령 성별
학생1  15  남
예은   17  여

2. 8 강의 자료 19페이지 데이터 프레임 생성

In [ ]:
exam_data={
    "수학":[90, 80, 70],
    "영어":[98,89,95],
    "음악":[85,95,100],
    "체육":[100,90,90]
}

In [ ]:
pd.DataFrame(exam_data)

   수학  영어   음악   체육
0  90  98   85  100
1  80  89   95   90
2  70  95  100   90

In [ ]:
pd.DataFrame(exam_data, index=["서준","우현","인아"])

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [ ]:
df=pd.DataFrame(exam_data, index=["서준","우현","인아"])

2 9 우현 줄부터 인아 줄까지

In [ ]:
df.loc["우현":"인아"]

    수학  영어   음악  체육
우현  80  89   95  90
인아  70  95  100  90

In [ ]:
#서준줄부터 인아줄까지
df.loc["서준":"인아"]

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [ ]:
#첫번째 줄부터 마지막 줄까지 복사본을 리턴(원본은 그대로) 
df.loc[ : ]

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [ ]:
#loc 함수 생략  (첫번째 줄부터 마지막/ 줄까지 복사해서  복사본 리딩)
df[:]

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

 * 데이터 프레임을 그대로 대입하면 같은 하나의 데이터를 공유 한다는 의미
 * 한쪽에서 수정하면 다른쪽도 데이터가 수정됨

 
 * df와 df2가 같은 하나의 데이터를 공유
 * 한쪽에서 데이터가 수정되면 다른쪽에서도 수정

In [ ]:
df2=df

In [ ]:
df2

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [ ]:
#우현 줄 삭제 
df2.drop("우현", inplace = True)

In [ ]:
df2

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [ ]:
#df에도 우현 줄 없음
df

복사본을 대입

In [ ]:
exam_data={
    "수학":[90, 80, 70],
    "영어":[98,89,95],
    "음악":[85,95,100],
    "체육":[100,90,90]
}

In [ ]:
df=pd.DataFrame(exam_data, index=["서준","우현","인아"])

In [ ]:
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [ ]:
#loc 함수 생략 (첫번째 줄부터 마지막 줄까지 복사해서 복사본을 리턴)-원본은 그대로
df2=df[:]